tefilus/MBD_PMSM/exampleSixStep/sixstep_f28069mLaunchPad_ert_rtw/sixstep_f28069mLaunchPad.h
/* Block states (default storage) for system '<Root>' */
typedef struct {
  real32_T Integrator_DSTATE;          /* '<S71>/Integrator' */
  real32_T UnitDelay_DSTATE;           /* '<S183>/Unit Delay' */
  uint32_T Delay_DSTATE[20];           /* '<S180>/Delay' */
  uint32_T UnitDelay_DSTATE_l;         /* '<S121>/Unit Delay' */
  uint32_T Delay_DSTATE_l;             /* '<S121>/Delay' */
  uint32_T UnitDelay1_DSTATE;          /* '<S175>/Unit Delay1' */
  volatile real32_T RT1_Buffer[2];     /* '<Root>/RT1' */
  volatile real32_T RT6_Buffer[2];     /* '<Root>/RT6' */
  volatile real32_T RT2_Buffer[2];     /* '<Root>/RT2' */
  real32_T speedSCI_B;                 /* '<Root>/Data Store Memory3' */
  int32_T DigitalOutput1_FRAC_LEN;     /* '<S8>/Digital Output1' */
  int32_T DigitalOutput_FRAC_LEN;      /* '<S217>/Digital Output' */
  int32_T Add_DWORK1[3];               /* '<S114>/Add' */
  int32_T DigitalOutput_FRAC_LEN_f;    /* '<S202>/Digital Output' */
  int32_T SpeedCount_DWORK1;           /* '<S180>/SpeedCount' */
  int16_T UnitDelay_DSTATE_dg;         /* '<S115>/Unit Delay' */
  uint16_T Output_DSTATE;              /* '<S111>/Output' */
  uint16_T DelayOneStep_DSTATE;        /* '<S124>/Delay One Step' */
  volatile int16_T RT1_ActiveBufIdx;   /* '<Root>/RT1' */
  volatile int16_T RT1_semaphoreTaken; /* '<Root>/RT1' */
  volatile int16_T RT6_ActiveBufIdx;   /* '<Root>/RT6' */
  volatile int16_T RT2_ActiveBufIdx;   /* '<Root>/RT2' */
  uint16_T IaOffset;                   /* '<Root>/Data Store Memory1' */
  uint16_T IbOffset;                   /* '<Root>/Data Store Memory2' */
  uint16_T IcOffset;                   /* '<Root>/Data Store Memory9' */
  uint16_T Memory_PreviousInput;       /* '<S226>/Memory' */
  uint16_T Memory1_PreviousInput;      /* '<S226>/Memory1' */
  uint16_T Memory2_PreviousInput;      /* '<S226>/Memory2' */
  uint16_T Add_DWORK1_o;               /* '<S204>/Add' */
  uint16_T CircBufIdx;                 /* '<S180>/Delay' */
  boolean_T DelayOneStep1_DSTATE;      /* '<S124>/Delay One Step1' */
  int16_T Integrator_PrevResetState;   /* '<S71>/Integrator' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory29' */
  rtDW_To_LCD_sixstep_f28069mLaun To_LCD;/* '<Root>/To_LCD' */
  rtDW_SpeedControl_sixstep_f2806 SpeedControl;/* '<Root>/Speed Control' */
  rtDW_SPIMasterTransfer_sixstep_ SPIMasterTransfer1;/* '<S217>/SPI Master Transfer' */
  rtDW_SPIMasterTransfer_sixstep_ SPIMasterTransfer;/* '<S217>/SPI Master Transfer' */
} D_Work_sixstep_f28069mLaunchPad;

/* Zero-crossing (trigger) state */
typedef struct {
  ZCSigState Delay_Reset_ZCE;          /* '<S121>/Delay' */
} PrevZCSigStates_sixstep_f28069m;

/* Invariant block signals (default storage) */
typedef struct {
  const real32_T SpeedConstData;       /* '<S126>/SpeedConstData' */
  const uint16_T dataWidth;            /* '<S10>/dataWidth' */
} ConstBlockIO_sixstep_f28069mLau;

/* Constant parameters (default storage) */
typedef struct {
  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S35>/SC1'
   *   '<S36>/SC2'
   *   '<S105>/SB1'
   *   '<S106>/SB2'
   */
  boolean_T pooled37[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S35>/SC2'
   *   '<S36>/SC1'
   *   '<S105>/SA1'
   *   '<S106>/SA2'
   */
  boolean_T pooled38[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S105>/SA2'
   *   '<S106>/SA1'
   */
  boolean_T pooled39[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S105>/SB2'
   *   '<S106>/SB1'
   */
  boolean_T pooled40[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S105>/SC1'
   *   '<S106>/SC2'
   */
  boolean_T pooled41[8];

  /* Pooled Parameter (Mixed Expressions)
   * Referenced by:
   *   '<S105>/SC2'
   *   '<S106>/SC1'
   */
  boolean_T pooled42[8];
} ConstParam_sixstep_f28069mLaunc;

/* Real-time Model Data Structure */
struct tag_RTM_sixstep_f28069mLaunchPa {
  const char_T * volatile errorStatus;

  /*
   * Timing:
   * The following substructure contains information regarding
   * the timing information for the model.
   */
  struct {
    struct {
      uint16_T TID[2];
    } TaskCounters;
  } Timing;
};

/* Block signals (default storage) */
extern BlockIO_sixstep_f28069mLaunchPa sixstep_f28069mLaunchPad_B;

/* Block states (default storage) */
extern D_Work_sixstep_f28069mLaunchPad sixstep_f28069mLaunchPad_DWork;

/* Zero-crossing (trigger) state */
extern PrevZCSigStates_sixstep_f28069m sixstep_f28069mL_PrevZCSigState;
extern const ConstBlockIO_sixstep_f28069mLau sixstep_f28069mLaunchPad_ConstB;/* constant block i/o */

/* Constant parameters (default storage) */
extern const ConstParam_sixstep_f28069mLaunc sixstep_f28069mLaunchPad_ConstP;

/* External function called from main */
extern void sixstep_f28069mLaunchPad_SetEventsForThisBaseStep(boolean_T
  *eventFlags);

/* Model entry point functions */
extern void sixstep_f28069mLaunchPad_initialize(void);
extern void sixstep_f28069mLaunchPad_step0(void);
extern void sixstep_f28069mLaunchPad_step1(void);
extern void sixstep_f28069mLaunchPad_terminate(void);

/* Real-time Model object */
extern RT_MODEL_sixstep_f28069mLaunchP *const sixstep_f28069mLaunchPad_M;
extern volatile boolean_T stopRequested;
extern volatile boolean_T runModel;

#ifdef __cpluscplus

extern "C"
{

#endif

  interrupt void ADCINT1(void);
  interrupt void SCIRXINTA(void);
  void sixstep_f28069mLaunchPad_configure_interrupts (void);
  void sixstep_f28069mLaunchPad_unconfigure_interrupts (void);

#ifdef __cpluscplus

}

#endif

/*-
 * The generated code includes comments that allow you to trace directly
 * back to the appropriate location in the model.  The basic format
 * is <system>/block_name, where system is the system number (uniquely
 * assigned by Simulink) and block_name is the name of the block.
 *
 * Use the MATLAB hilite_system command to trace the generated code back
 * to the model.  For example,
 *
 * hilite_system('<S3>')    - opens system 3
 * hilite_system('<S3>/Kp') - opens and selects block Kp which resides in S3
 *
 * Here is the system hierarchy for this model
 *
 * '<Root>' : 'sixstep_f28069mLaunchPad'
 * '<S1>'   : 'sixstep_f28069mLaunchPad/Current Control'
 * '<S2>'   : 'sixstep_f28069mLaunchPad/HW_Interrupt'
 * '<S3>'   : 'sixstep_f28069mLaunchPad/Hardware Init'
 * '<S4>'   : 'sixstep_f28069mLaunchPad/Inverter and Motor - Plant Model'
 * '<S5>'   : 'sixstep_f28069mLaunchPad/Serial Receive'
 * '<S6>'   : 'sixstep_f28069mLaunchPad/Speed Control'
 * '<S7>'   : 'sixstep_f28069mLaunchPad/To_LCD'
 * '<S8>'   : 'sixstep_f28069mLaunchPad/Toggle LED'
 * '<S9>'   : 'sixstep_f28069mLaunchPad/Current Control/Control_System'
 * '<S10>'  : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging'
 * '<S11>'  : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling'
 * '<S12>'  : 'sixstep_f28069mLaunchPad/Current Control/Inverter'
 * '<S13>'  : 'sixstep_f28069mLaunchPad/Current Control/SCI_Tx'
 * '<S14>'  : 'sixstep_f28069mLaunchPad/Current Control/Sensor Driver Blocks'
 * '<S15>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation'
 * '<S16>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc'
 * '<S17>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation'
 * '<S18>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation'
 * '<S19>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/HALL'
 * '<S20>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position'
 * '<S21>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Sector2vector'
 * '<S22>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/SwitchingSequence'
 * '<S23>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant'
 * '<S24>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120'
 * '<S25>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem'
 * '<S26>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem1'
 * '<S27>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem2'
 * '<S28>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem3'
 * '<S29>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem4'
 * '<S30>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem5'
 * '<S31>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem6'
 * '<S32>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Sector2vector/Bit Extract'
 * '<S33>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Sector2vector/Default '
 * '<S34>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/Sector2vector/Bit Extract/Extract Bits'
 * '<S35>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/SwitchingSequence/negative'
 * '<S36>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Hall_Commutation/Six Step Commutation/SwitchingSequence/positive'
 * '<S37>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset'
 * '<S38>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S39>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S40>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S41>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S42>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S43>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S44>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S45>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S46>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S47>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S48>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S49>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S50>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S51>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S52>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S53>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S54>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S55>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S56>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S57>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S58>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S59>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S60>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S61>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S62>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S63>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S64>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S65>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S66>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S67>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S68>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S69>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S70>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S71>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S72>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S73>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S74>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S75>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S76>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S77>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S78>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S79>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S80>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S81>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S82>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S83>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S84>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/TsSignalSpecification'
 * '<S85>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S86>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S87>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/PI_Controller_Idc/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S88>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation'
 * '<S89>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/HALL'
 * '<S90>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position'
 * '<S91>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector'
 * '<S92>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence'
 * '<S93>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant'
 * '<S94>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120'
 * '<S95>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem'
 * '<S96>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem1'
 * '<S97>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem2'
 * '<S98>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem3'
 * '<S99>'  : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem4'
 * '<S100>' : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem5'
 * '<S101>' : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Position/PositionSectorvariant/Sector120/Enabled Subsystem6'
 * '<S102>' : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Bit Extract'
 * '<S103>' : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Default '
 * '<S104>' : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/Sector2vector/Bit Extract/Extract Bits'
 * '<S105>' : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence/negative'
 * '<S106>' : 'sixstep_f28069mLaunchPad/Current Control/Control_System/Pos_Commutation/Six Step Commutation/SwitchingSequence/positive'
 * '<S107>' : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging/Data'
 * '<S108>' : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging/Data_Conditioning'
 * '<S109>' : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging/End'
 * '<S110>' : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging/Start'
 * '<S111>' : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging/dataIndexCounter'
 * '<S112>' : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging/dataIndexCounter/Increment Real World'
 * '<S113>' : 'sixstep_f28069mLaunchPad/Current Control/Data_Logging/dataIndexCounter/Wrap To Zero'
 * '<S114>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Convert ADC value to PU'
 * '<S115>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback'
 * '<S116>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/QEP Feedback'
 * '<S117>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Convert ADC value to PU/LowerSwitchCurrents'
 * '<S118>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position'
 * '<S119>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Validity'
 * '<S120>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/IIR Filter'
 * '<S121>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Speed Counter'
 * '<S122>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Subsystem'
 * '<S123>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/ExtrapolationOrder'
 * '<S124>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/Software Watchdog Timer'
 * '<S125>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant'
 * '<S126>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position'
 * '<S127>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/VaidityCheck'
 * '<S128>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/Software Watchdog Timer/Compare To Zero'
 * '<S129>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction'
 * '<S130>' : 'sixstep_f28069mLaunchPad/Current Control/Input Scaling/Hall Feedback/Hall Speed and Position/Speed and direction are not valid Position will be set to the middle of the Hall quadrant/independent Direction/Hall Value of 1'
